In [1]:
import pandas as pd
import numpy as np
import pathfinder as pf

In [2]:
filename = "censo_1872_ce-002_p1.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

In [3]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28
0,NaN,NaN,NaN,Raças,NaN,NaN,NaN,Estados civis,NaN,NaN,...,Defeitos físicos,NaN,NaN,NaN,NaN,NaN,NaN,Casas,NaN,NaN
1,Condições,Sexos,Almas,Brancos,Pardos,Pretos,Caboclos,Solteiros,Casados,Viúvos,...,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados,Ausentes,Transeuntes,Habitadas,Desabitadas,Fogos
2,Livres,Homens,10322,4940,4332,436,614,7154,2775,393,...,48,6,158,16,11,41,301,NaN,NaN,NaN
3,NaN,Mulheres,9867,4364,4601,470,432,6979,2097,791,...,41,9,32,21,9,76,247,NaN,NaN,NaN
4,NaN,Soma,20189,9304,8933,906,1046,14133,4872,1184,...,89,15,190,37,20,117,548,3359,1025,3403
5,Escravos,Homens,522,0,326,196,0,502,14,6,...,0,0,2,0,0,0,0,NaN,NaN,NaN
6,NaN,Mulheres,661,0,365,296,0,638,19,4,...,0,0,2,2,2,0,0,NaN,NaN,NaN
7,NaN,Soma,1183,0,691,492,0,1140,33,10,...,0,0,4,2,2,0,0,NaN,NaN,NaN
8,NaN,Soma geral,21372,9304,9624,1398,1046,15273,4905,1194,...,89,15,194,39,22,117,548,3359,1025,3403

In [4]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Instrução',
       'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22',
       'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26',
       'Unnamed: 27', 'Unnamed: 28'],
      dtype='object')

# ALMAS

In [5]:
almas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2']]
almas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0        NaN        NaN        NaN
1  Condições      Sexos      Almas
2     Livres     Homens      10322
3        NaN   Mulheres       9867
4        NaN       Soma      20189

In [6]:
new_header = almas.iloc[1]
almas.columns = new_header
almas = almas[2:]
almas.head()

1 Condições     Sexos  Almas
2    Livres    Homens  10322
3       NaN  Mulheres   9867
4       NaN      Soma  20189
5  Escravos    Homens    522
6       NaN  Mulheres    661

In [7]:
df_no_transpose = almas.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos  Almas
2    Livres      Homens  10322
3       NaN    Mulheres   9867
4       NaN        Soma  20189
5  Escravos      Homens    522
6       NaN    Mulheres    661
7       NaN        Soma   1183
8     Total  Soma geral  21372

In [8]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos  Almas
2    Livres      Homens  10322
3    Livres    Mulheres   9867
4    Livres        Soma  20189
5  Escravos      Homens    522
6  Escravos    Mulheres    661
7  Escravos        Soma   1183
8     Total  Soma geral  21372

In [9]:
colunas_almas = ['Almas']
df_no_transpose[colunas_almas] = df_no_transpose[colunas_almas].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

homens_livres = int(homens_livres[colunas_almas].sum())
homens_escravos = int(homens_escravos[colunas_almas].sum())


soma_homens = homens_livres + homens_escravos

soma_homens

10844

In [10]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

mulheres_livres = int(mulheres_livres[colunas_almas].sum())
mulheres_escravas = int(mulheres_escravas[colunas_almas].sum())

soma_mulheres = mulheres_livres + mulheres_escravas

soma_mulheres

10528

In [11]:
print("Total de almas: " + str(soma_homens + soma_mulheres))

Total de almas: 21372

# RAÇAS

In [12]:
racas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6']]
racas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 3 Unnamed: 4 Unnamed: 5 Unnamed: 6
0        NaN        NaN      Raças        NaN        NaN        NaN
1  Condições      Sexos    Brancos     Pardos     Pretos   Caboclos
2     Livres     Homens       4940       4332        436        614
3        NaN   Mulheres       4364       4601        470        432
4        NaN       Soma       9304       8933        906       1046

In [13]:
new_header = racas.iloc[1]
racas.columns = new_header
racas = racas[2:]
racas.head()

1 Condições     Sexos Brancos Pardos Pretos Caboclos
2    Livres    Homens    4940   4332    436      614
3       NaN  Mulheres    4364   4601    470      432
4       NaN      Soma    9304   8933    906     1046
5  Escravos    Homens       0    326    196        0
6       NaN  Mulheres       0    365    296        0

In [14]:
racas.loc[8, "Condições"] = 'Total'
racas

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3       NaN    Mulheres    4364   4601    470      432
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [15]:
racas['Condições'] = racas['Condições'].ffill()
racas

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3    Livres    Mulheres    4364   4601    470      432
4    Livres        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6  Escravos    Mulheres       0    365    296        0
7  Escravos        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [16]:
colunas_racas = ['Brancos', 'Pardos', 'Pretos', 'Caboclos']
colunas_brancos = ['Brancos']
colunas_pardos = ['Pardos']
colunas_pretos = ['Pretos']
colunas_caboclos = ['Caboclos']


racas[colunas_brancos] = racas[colunas_brancos].apply(pd.to_numeric)

total_homens_brancos_livres = racas.iloc[0,2]
total_mulheres_brancas_livres = racas.iloc[1,2]
total_brancos_livres = racas.iloc[2,2]

total_homens_brancos_escravos = racas.iloc[3,2]
total_mulheres_brancas_escravas = racas.iloc[4,2]
total_brancos_escravos = racas.iloc[5,2]
total_brancos_geral = racas.iloc[6,2]

soma_racas_brancos = (int(racas[colunas_brancos].sum())) - total_brancos_livres - total_brancos_escravos - total_brancos_geral

print("Homens brancos livres: " + str(total_homens_brancos_livres))
print("Mulheres brancas livres: " + str(total_mulheres_brancas_livres))
print("Total de brancos livres: " + str(total_brancos_livres))
print("Homens brancos escravos: " + str(total_homens_brancos_escravos))
print("Mulheres brancas escravas: " + str(total_mulheres_brancas_escravas))
print("Total de brancos escravos: " + str(total_brancos_escravos))
print("Total de brancos: " + str(soma_racas_brancos))

if soma_racas_brancos == total_brancos_geral:
    print("OK1")


racas[colunas_pardos] = racas[colunas_pardos].apply(pd.to_numeric)

total_homens_pardos_livres = racas.iloc[0,3]
total_mulheres_pardas_livres = racas.iloc[1,3]
total_pardos_livres = racas.iloc[2,3]

total_homens_pardos_escravos = racas.iloc[3,3]
total_mulheres_pardas_escravas = racas.iloc[4,3]
total_pardos_escravos = racas.iloc[5,3]
total_pardos_geral = racas.iloc[6,3]

soma_racas_pardos = int(racas[colunas_pardos].sum()) - total_pardos_livres - total_pardos_escravos - total_pardos_geral

print("Homens pardos livres: " + str(total_homens_pardos_livres))
print("Mulheres pardas livres: " + str(total_mulheres_pardas_livres))
print("Total de pardos livres: " + str(total_pardos_livres))
print("Homens pardos escravos: " + str(total_homens_pardos_escravos))
print("Mulheres pardas escravas: " + str(total_mulheres_pardas_escravas))
print("Total de pardos escravos: " + str(total_pardos_escravos))
print("Total de pardos: " + str(soma_racas_pardos))

if soma_racas_pardos == total_pardos_geral:
    print("OK2")

racas[colunas_pretos] = racas[colunas_pretos].apply(pd.to_numeric)

total_homens_pretos_livres = racas.iloc[0,4]
total_mulheres_pretas_livres = racas.iloc[1,4]
total_pretos_livres = racas.iloc[2,4]

total_homens_pretos_escravos = racas.iloc[3,4]
total_mulheres_pretas_escravas = racas.iloc[4,4]
total_pretos_escravos = racas.iloc[5,4]
total_pretos_geral = racas.iloc[6,4]

soma_racas_pretos = int(racas[colunas_pretos].sum()) - total_pretos_livres - total_pretos_escravos - total_pretos_geral

print("Homens pretos livres: " + str(total_homens_pretos_livres))
print("Mulheres pretas livres: " + str(total_mulheres_pretas_livres))
print("Total de pretos livres: " + str(total_pretos_livres))
print("Homens pretos escravos: " + str(total_homens_pretos_escravos))
print("Mulheres pretas escravas: " + str(total_mulheres_pretas_escravas))
print("Total de pretos escravos: " + str(total_pretos_escravos))
print("Total de pretos: " + str(soma_racas_pretos))

if soma_racas_pretos == total_pretos_geral:
    print("OK3")


racas[colunas_caboclos] = racas[colunas_caboclos].apply(pd.to_numeric)

total_homens_caboclos_livres = racas.iloc[0,5]
total_mulheres_caboclas_livres = racas.iloc[1,5]
total_caboclos_livres = racas.iloc[2,5]

total_homens_caboclos_escravos = racas.iloc[3,5]
total_mulheres_caboclas_escravas = racas.iloc[4,5]
total_caboclos_escravos = racas.iloc[5,5]
total_caboclos_geral = racas.iloc[6,5]

soma_racas_caboclos = int(racas[colunas_caboclos].sum()) - total_caboclos_livres - total_caboclos_escravos - total_caboclos_geral

print("Homens caboclos livres: " + str(total_homens_caboclos_livres))
print("Mulheres caboclas livres: " + str(total_mulheres_caboclas_livres))
print("Total de caboclos livres: " + str(total_caboclos_livres))
print("Homens caboclos escravos: " + str(total_homens_caboclos_escravos))
print("Mulheres caboclas escravas: " + str(total_mulheres_caboclas_escravas))
print("Total de caboclos escravos: " + str(total_caboclos_escravos))
print("Total de caboclos: " + str(soma_racas_caboclos))

if soma_racas_caboclos == total_caboclos_geral:
    print("OK4")

Homens brancos livres: 4940
Mulheres brancas livres: 4364
Total de brancos livres: 9304
Homens brancos escravos: 0
Mulheres brancas escravas: 0
Total de brancos escravos: 0
Total de brancos: 9304
OK1
Homens pardos livres: 4332
Mulheres pardas livres: 4601
Total de pardos livres: 8933
Homens pardos escravos: 326
Mulheres pardas escravas: 365
Total de pardos escravos: 691
Total de pardos: 9624
OK2
Homens pretos livres: 436
Mulheres pretas livres: 470
Total de pretos livres: 906
Homens pretos escravos: 196
Mulheres pretas escravas: 296
Total de pretos escravos: 492
Total de pretos: 1398
OK3
Homens caboclos livres: 614
Mulheres caboclas livres: 432
Total de caboclos livres: 1046
Homens caboclos escravos: 0
Mulheres caboclas escravas: 0
Total de caboclos escravos: 0
Total de caboclos: 1046
OK4

In [17]:
# colunas_racas = ['Brancos', 'Pardos', 'Pretos', 'Caboclos']
# df_no_transpose[colunas_racas] = df_no_transpose[colunas_racas].apply(pd.to_numeric)

# # Passo 1: Selecionar as linhas específicas
# homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
# homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# # Passo 2: Somar os valores das colunas
# soma_homens = homens_livres[colunas_racas].sum() + homens_escravos[colunas_racas].sum()

# soma_homens

In [18]:
# mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
# mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_racas].sum() + mulheres_escravas[colunas_racas].sum()

# soma_mulheres

# ESTADOS CIVIS

In [19]:
estados_civis = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 7 Unnamed: 8 Unnamed: 9
0        NaN        NaN  Estados civis        NaN        NaN
1  Condições      Sexos      Solteiros    Casados     Viúvos
2     Livres     Homens           7154       2775        393
3        NaN   Mulheres           6979       2097        791
4        NaN       Soma          14133       4872       1184

In [20]:
new_header = estados_civis.iloc[1]
estados_civis.columns = new_header
estados_civis = estados_civis[2:]
estados_civis.head()

1 Condições     Sexos Solteiros Casados Viúvos
2    Livres    Homens      7154    2775    393
3       NaN  Mulheres      6979    2097    791
4       NaN      Soma     14133    4872   1184
5  Escravos    Homens       502      14      6
6       NaN  Mulheres       638      19      4

In [21]:
estados_civis.loc[8, "Condições"] = 'Total'
estados_civis

1 Condições       Sexos Solteiros Casados Viúvos
2    Livres      Homens      7154    2775    393
3       NaN    Mulheres      6979    2097    791
4       NaN        Soma     14133    4872   1184
5  Escravos      Homens       502      14      6
6       NaN    Mulheres       638      19      4
7       NaN        Soma      1140      33     10
8     Total  Soma geral     15273    4905   1194

In [22]:
estados_civis['Condições'] = estados_civis['Condições'].ffill()
estados_civis

1 Condições       Sexos Solteiros Casados Viúvos
2    Livres      Homens      7154    2775    393
3    Livres    Mulheres      6979    2097    791
4    Livres        Soma     14133    4872   1184
5  Escravos      Homens       502      14      6
6  Escravos    Mulheres       638      19      4
7  Escravos        Soma      1140      33     10
8     Total  Soma geral     15273    4905   1194

In [23]:
colunas_estados_civis = ['Solteiros', 'Casados', 'Viúvos']
colunas_solteiros = ['Solteiros']
colunas_casados = ['Casados']
colunas_viuvos = ['Viúvos']


estados_civis[colunas_solteiros] = estados_civis[colunas_solteiros].apply(pd.to_numeric)

total_homens_solteiros_livres = estados_civis.iloc[0,2]
total_mulheres_solteiras_livres = estados_civis.iloc[1,2]
total_solteiros_livres = estados_civis.iloc[2,2]

total_homens_solteiros_escravos = estados_civis.iloc[3,2]
total_mulheres_solteiras_escravas = estados_civis.iloc[4,2]
total_solteiros_escravos = estados_civis.iloc[5,2]
total_solteiros_geral = estados_civis.iloc[6,2]

soma_estados_civis_solteiros = (int(estados_civis[colunas_solteiros].sum())) - total_solteiros_livres - total_solteiros_escravos - total_solteiros_geral

print("Homens solteiros livres: " + str(total_homens_solteiros_livres))
print("Mulheres solteiras livres: " + str(total_mulheres_solteiras_livres))
print("Total de solteiros livres: " + str(total_solteiros_livres))
print("Homens solteiros escravos: " + str(total_homens_solteiros_escravos))
print("Mulheres solteiras escravas: " + str(total_mulheres_solteiras_escravas))
print("Total de solteiros escravos: " + str(total_solteiros_escravos))
print("Total de solteiros: " + str(soma_estados_civis_solteiros))

if soma_estados_civis_solteiros == total_solteiros_geral:
    print("OK1")


estados_civis[colunas_casados] = estados_civis[colunas_casados].apply(pd.to_numeric)

total_homens_casados_livres = estados_civis.iloc[0,3]
total_mulheres_casadas_livres = estados_civis.iloc[1,3]
total_casados_livres = estados_civis.iloc[2,3]

total_homens_casados_escravos = estados_civis.iloc[3,3]
total_mulheres_casadas_escravas = estados_civis.iloc[4,3]
total_casados_escravos = estados_civis.iloc[5,3]
total_casados_geral = estados_civis.iloc[6,3]

soma_estados_civis_casados = int(estados_civis[colunas_casados].sum()) - total_casados_livres - total_casados_escravos - total_casados_geral

print("Homens casados livres: " + str(total_homens_casados_livres))
print("Mulheres casadas livres: " + str(total_mulheres_casadas_livres))
print("Total de casados livres: " + str(total_casados_livres))
print("Homens casados escravos: " + str(total_homens_casados_escravos))
print("Mulheres casadas escravas: " + str(total_mulheres_casadas_escravas))
print("Total de casados escravos: " + str(total_casados_escravos))
print("Total de casados: " + str(soma_estados_civis_casados))

if soma_estados_civis_casados == total_casados_geral:
    print("OK2")

estados_civis[colunas_viuvos] = estados_civis[colunas_viuvos].apply(pd.to_numeric)

total_homens_viuvos_livres = estados_civis.iloc[0,4]
total_mulheres_viuvas_livres = estados_civis.iloc[1,4]
total_viuvos_livres = estados_civis.iloc[2,4]

total_homens_viuvos_escravos = estados_civis.iloc[3,4]
total_mulheres_viuvas_escravas = estados_civis.iloc[4,4]
total_viuvos_escravos = estados_civis.iloc[5,4]
total_viuvos_geral = estados_civis.iloc[6,4]

soma_estados_civis_viuvos = int(estados_civis[colunas_viuvos].sum()) - total_viuvos_livres - total_viuvos_escravos - total_viuvos_geral

print("Homens viúvos livres: " + str(total_homens_viuvos_livres))
print("Mulheres viúvas livres: " + str(total_mulheres_viuvas_livres))
print("Total de viúvos livres: " + str(total_viuvos_livres))
print("Homens viúvos escravos: " + str(total_homens_viuvos_escravos))
print("Mulheres viúvas escravas: " + str(total_mulheres_viuvas_escravas))
print("Total de viúvos escravos: " + str(total_viuvos_escravos))
print("Total de viúvos: " + str(soma_estados_civis_viuvos))

if soma_estados_civis_viuvos == total_viuvos_geral:
    print("OK3")

Homens solteiros livres: 7154
Mulheres solteiras livres: 6979
Total de solteiros livres: 14133
Homens solteiros escravos: 502
Mulheres solteiras escravas: 638
Total de solteiros escravos: 1140
Total de solteiros: 15273
OK1
Homens casados livres: 2775
Mulheres casadas livres: 2097
Total de casados livres: 4872
Homens casados escravos: 14
Mulheres casadas escravas: 19
Total de casados escravos: 33
Total de casados: 4905
OK2
Homens viúvos livres: 393
Mulheres viúvas livres: 791
Total de viúvos livres: 1184
Homens viúvos escravos: 6
Mulheres viúvas escravas: 4
Total de viúvos escravos: 10
Total de viúvos: 1194
OK3

In [24]:
# colunas_estados_civis = ['Casados', 'Solteiros', 'Viúvos']
# df_no_transpose[colunas_estados_civis] = df_no_transpose[colunas_estados_civis].apply(pd.to_numeric)

# homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
# homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# soma_homens = homens_livres[colunas_estados_civis].sum() + homens_escravos[colunas_estados_civis].sum()

# soma_homens

In [25]:
# mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
# mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_estados_civis].sum() + mulheres_escravas[colunas_estados_civis].sum()

# soma_mulheres

# RELIGIÃO

In [26]:
religiao = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 10', 'Unnamed: 11']]
religiao.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 10 Unnamed: 11
0        NaN        NaN    Religião         NaN
1  Condições      Sexos   Católicos  Acatólicos
2     Livres     Homens       10288          34
3        NaN   Mulheres        9859           8
4        NaN       Soma       20147          42

In [27]:
religiao_header = religiao.iloc[1]
religiao.columns = religiao_header
religiao = religiao[2:]
religiao.head()

1 Condições     Sexos Católicos Acatólicos
2    Livres    Homens     10288         34
3       NaN  Mulheres      9859          8
4       NaN      Soma     20147         42
5  Escravos    Homens       522          0
6       NaN  Mulheres       661          0

In [28]:
religiao.loc[8, "Condições"] = 'Total'
religiao

1 Condições       Sexos Católicos Acatólicos
2    Livres      Homens     10288         34
3       NaN    Mulheres      9859          8
4       NaN        Soma     20147         42
5  Escravos      Homens       522          0
6       NaN    Mulheres       661          0
7       NaN        Soma      1183          0
8     Total  Soma geral     21330         42

In [29]:
religiao['Condições'] = religiao['Condições'].ffill()
religiao

1 Condições       Sexos Católicos Acatólicos
2    Livres      Homens     10288         34
3    Livres    Mulheres      9859          8
4    Livres        Soma     20147         42
5  Escravos      Homens       522          0
6  Escravos    Mulheres       661          0
7  Escravos        Soma      1183          0
8     Total  Soma geral     21330         42

In [30]:
colunas_religiao = ['Católicos', 'Acatólicos']
colunas_catolicos = ['Católicos']
colunas_acatolicos = ['Acatólicos']


religiao[colunas_catolicos] = religiao[colunas_catolicos].apply(pd.to_numeric)

total_homens_catolicos_livres = religiao.iloc[0,2]
total_mulheres_catolicas_livres = religiao.iloc[1,2]
total_catolicos_livres = religiao.iloc[2,2]

total_homens_catolicos_escravos = religiao.iloc[3,2]
total_mulheres_catolicas_escravas = religiao.iloc[4,2]
total_catolicos_escravos = religiao.iloc[5,2]
total_catolicos_geral = religiao.iloc[6,2]

soma_religiao_catolicos = (int(religiao[colunas_catolicos].sum())) - total_catolicos_livres - total_catolicos_escravos - total_catolicos_geral

print("Homens católicos livres: " + str(total_homens_catolicos_livres))
print("Mulheres católicas livres: " + str(total_mulheres_catolicas_livres))
print("Total de católicos livres: " + str(total_catolicos_livres))
print("Homens católicos escravos: " + str(total_homens_catolicos_escravos))
print("Mulheres católicas escravas: " + str(total_mulheres_catolicas_escravas))
print("Total de católicos escravos: " + str(total_catolicos_escravos))
print("Total de católicos: " + str(soma_religiao_catolicos))

if soma_religiao_catolicos == total_catolicos_geral:
    print("OK1")


religiao[colunas_acatolicos] = religiao[colunas_acatolicos].apply(pd.to_numeric)

total_homens_acatolicos_livres = religiao.iloc[0,3]
total_mulheres_acatolicas_livres = religiao.iloc[1,3]
total_acatolicos_livres = religiao.iloc[2,3]

total_homens_acatolicos_escravos = religiao.iloc[3,3]
total_mulheres_acatolicas_escravas = religiao.iloc[4,3]
total_acatolicos_escravos = religiao.iloc[5,3]
total_acatolicos_geral = religiao.iloc[6,3]

soma_religiao_acatolicos = int(religiao[colunas_acatolicos].sum()) - total_acatolicos_livres - total_acatolicos_escravos - total_acatolicos_geral

print("Homens acatólicos livres: " + str(total_homens_acatolicos_livres))
print("Mulheres acatólicas livres: " + str(total_mulheres_acatolicas_livres))
print("Total de acatólicos livres: " + str(total_acatolicos_livres))
print("Homens acatólicos escravos: " + str(total_homens_acatolicos_escravos))
print("Mulheres acatólicas escravas: " + str(total_mulheres_acatolicas_escravas))
print("Total de acatólicos escravos: " + str(total_acatolicos_escravos))
print("Total de acatólicos: " + str(soma_religiao_acatolicos))

if soma_religiao_acatolicos == total_acatolicos_geral:
    print("OK2")

Homens católicos livres: 10288
Mulheres católicas livres: 9859
Total de católicos livres: 20147
Homens católicos escravos: 522
Mulheres católicas escravas: 661
Total de católicos escravos: 1183
Total de católicos: 21330
OK1
Homens acatólicos livres: 34
Mulheres acatólicas livres: 8
Total de acatólicos livres: 42
Homens acatólicos escravos: 0
Mulheres acatólicas escravas: 0
Total de acatólicos escravos: 0
Total de acatólicos: 42
OK2

In [31]:
# colunas_religiao = ['Católicos', 'Acatólicos']
# df_no_transpose[colunas_religiao] = df_no_transpose[colunas_religiao].apply(pd.to_numeric)

# homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
# homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# soma_homens = homens_livres[colunas_religiao].sum() + homens_escravos[colunas_religiao].sum()

# soma_homens

In [32]:
# mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
# mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_religiao].sum() + mulheres_escravas[colunas_religiao].sum()

# soma_mulheres

# NACIONALIDADES

In [33]:
nacionalidades = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 12', 'Unnamed: 13']]
nacionalidades.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 12   Unnamed: 13
0        NaN        NaN  Nacionalidades           NaN
1  Condições      Sexos     Brasileiros  Estrangeiros
2     Livres     Homens            9779           543
3        NaN   Mulheres            9661           206
4        NaN       Soma           19440           749

In [34]:
nacionalidades_header = nacionalidades.iloc[1]
nacionalidades.columns = nacionalidades_header
nacionalidades = nacionalidades[2:]
nacionalidades.head()

1 Condições     Sexos Brasileiros Estrangeiros
2    Livres    Homens        9779          543
3       NaN  Mulheres        9661          206
4       NaN      Soma       19440          749
5  Escravos    Homens         522            0
6       NaN  Mulheres         661            0

In [35]:
nacionalidades.loc[8, "Condições"] = 'Total'
nacionalidades

1 Condições       Sexos Brasileiros Estrangeiros
2    Livres      Homens        9779          543
3       NaN    Mulheres        9661          206
4       NaN        Soma       19440          749
5  Escravos      Homens         522            0
6       NaN    Mulheres         661            0
7       NaN        Soma        1183            0
8     Total  Soma geral       20623          749

In [36]:
nacionalidades['Condições'] = nacionalidades['Condições'].ffill()
nacionalidades

1 Condições       Sexos Brasileiros Estrangeiros
2    Livres      Homens        9779          543
3    Livres    Mulheres        9661          206
4    Livres        Soma       19440          749
5  Escravos      Homens         522            0
6  Escravos    Mulheres         661            0
7  Escravos        Soma        1183            0
8     Total  Soma geral       20623          749

In [37]:
colunas_nacionalidades = ['Brasileiros', 'Estrangeiros']
colunas_brasileiros = ['Brasileiros']
colunas_estrangeiros = ['Estrangeiros']


nacionalidades[colunas_brasileiros] = nacionalidades[colunas_brasileiros].apply(pd.to_numeric)

total_homens_brasileiros_livres = nacionalidades.iloc[0,2]
total_mulheres_catolicas_livres = nacionalidades.iloc[1,2]
total_brasileiros_livres = nacionalidades.iloc[2,2]

total_homens_brasileiros_escravos = nacionalidades.iloc[3,2]
total_mulheres_catolicas_escravas = nacionalidades.iloc[4,2]
total_brasileiros_escravos = nacionalidades.iloc[5,2]
total_brasileiros_geral = nacionalidades.iloc[6,2]

soma_nacionalidades_brasileiros = (int(nacionalidades[colunas_brasileiros].sum())) - total_brasileiros_livres - total_brasileiros_escravos - total_brasileiros_geral

print("Homens brasileiros livres: " + str(total_homens_brasileiros_livres))
print("Mulheres brasileiras livres: " + str(total_mulheres_catolicas_livres))
print("Total de brasileiros livres: " + str(total_brasileiros_livres))
print("Homens brasileiros escravos: " + str(total_homens_brasileiros_escravos))
print("Mulheres brasileiras escravas: " + str(total_mulheres_catolicas_escravas))
print("Total de brasileiros escravos: " + str(total_brasileiros_escravos))
print("Total de brasileiros: " + str(soma_nacionalidades_brasileiros))

if soma_nacionalidades_brasileiros == total_brasileiros_geral:
    print("OK1")


nacionalidades[colunas_estrangeiros] = nacionalidades[colunas_estrangeiros].apply(pd.to_numeric)

total_homens_estrangeiros_livres = nacionalidades.iloc[0,3]
total_mulheres_acatolicas_livres = nacionalidades.iloc[1,3]
total_estrangeiros_livres = nacionalidades.iloc[2,3]

total_homens_estrangeiros_escravos = nacionalidades.iloc[3,3]
total_mulheres_acatolicas_escravas = nacionalidades.iloc[4,3]
total_estrangeiros_escravos = nacionalidades.iloc[5,3]
total_estrangeiros_geral = nacionalidades.iloc[6,3]

soma_nacionalidades_estrangeiros = int(nacionalidades[colunas_estrangeiros].sum()) - total_estrangeiros_livres - total_estrangeiros_escravos - total_estrangeiros_geral

print("Homens estrangeiros livres: " + str(total_homens_estrangeiros_livres))
print("Mulheres estrangeiras livres: " + str(total_mulheres_acatolicas_livres))
print("Total de estrangeiros livres: " + str(total_estrangeiros_livres))
print("Homens estrangeiros escravos: " + str(total_homens_estrangeiros_escravos))
print("Mulheres estrangeiras escravas: " + str(total_mulheres_acatolicas_escravas))
print("Total de estrangeiros escravos: " + str(total_estrangeiros_escravos))
print("Total de estrangeiros: " + str(soma_nacionalidades_estrangeiros))

if soma_nacionalidades_estrangeiros == total_estrangeiros_geral:
    print("OK2")

Homens brasileiros livres: 9779
Mulheres brasileiras livres: 9661
Total de brasileiros livres: 19440
Homens brasileiros escravos: 522
Mulheres brasileiras escravas: 661
Total de brasileiros escravos: 1183
Total de brasileiros: 20623
OK1
Homens estrangeiros livres: 543
Mulheres estrangeiras livres: 206
Total de estrangeiros livres: 749
Homens estrangeiros escravos: 0
Mulheres estrangeiras escravas: 0
Total de estrangeiros escravos: 0
Total de estrangeiros: 749
OK2

In [38]:
# colunas_nacionalidades = ['Brasileiros', 'Estrangeiros']
# df_no_transpose[colunas_nacionalidades] = df_no_transpose[colunas_nacionalidades].apply(pd.to_numeric)

# homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
# homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# soma_homens = homens_livres[colunas_nacionalidades].sum() + homens_escravos[colunas_nacionalidades].sum()

# soma_homens

In [39]:
# mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
# mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_nacionalidades].sum() + mulheres_escravas[colunas_nacionalidades].sum()

# soma_mulheres

# INSTRUÇÃO

In [40]:
instrucao = df[['Unnamed: 0', 'Unnamed: 1', 'Instrução', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18']]
instrucao.head()

,Unnamed: 0,Unnamed: 1,Instrução,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965

In [41]:
instrucao_header = instrucao.iloc[1]
instrucao.columns = instrucao_header
instrucao = instrucao[2:]
instrucao.head()

1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965
5,Escravos,Homens,5,517,0,0,0
6,NaN,Mulheres,6,655,0,0,0

In [42]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', 'Condições'),
    ('', 'Sexos'),
    ('', 'Sabem ler e escrever'),
    ('', 'Analfabetos'),
    ('População escolar de 6 a 15 anos', 'Frequentam escolas'),
    ('População escolar de 6 a 15 anos', 'Não frequentam escolas'),
    ('População escolar de 6 a 15 anos', 'Total')
])

instrucao.columns = columns_multiindex

instrucao

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3       NaN    Mulheres                 1170        8697
4       NaN        Soma                 4436       15753
5  Escravos      Homens                    5         517
6       NaN    Mulheres                    6         655
7       NaN        Soma                   11        1172
8       NaN  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [43]:
instrucao.loc[8, ('', 'Condições')] = 'Total'
instrucao

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3       NaN    Mulheres                 1170        8697
4       NaN        Soma                 4436       15753
5  Escravos      Homens                    5         517
6       NaN    Mulheres                    6         655
7       NaN        Soma                   11        1172
8     Total  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [44]:
instrucao[('', 'Condições')] = instrucao[('', 'Condições')].ffill()
instrucao

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3    Livres    Mulheres                 1170        8697
4    Livres        Soma                 4436       15753
5  Escravos      Homens                    5         517
6  Escravos    Mulheres                    6         655
7  Escravos        Soma                   11        1172
8     Total  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [45]:
# colunas_adultos = [('', 'Sabem ler e escrever'), ('', 'Analfabetos')]
# instrucao[colunas_adultos] = instrucao[colunas_adultos].apply(pd.to_numeric)

# homens_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Homens')]
# homens_escravos = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Homens')]

# soma_homens = homens_livres[colunas_adultos].sum() + homens_escravos[colunas_adultos].sum()

# soma_homens

In [46]:
colunas_instrucao_adultos_alfabetizados = [('', 'Sabem ler e escrever')]
colunas_instrucao_adultos_analfabetos = [('', 'Analfabetos')]


instrucao[colunas_instrucao_adultos_alfabetizados] = instrucao[colunas_instrucao_adultos_alfabetizados].apply(pd.to_numeric)

total_homens_adultos_alfabetizados_livres = instrucao.iloc[0,2]
total_mulheres_adultas_alfabetizadas_livres = instrucao.iloc[1,2]
total_adultos_alfabetizados_livres = instrucao.iloc[2,2]

total_homens_adultos_alfabetizados_escravos = instrucao.iloc[3,2]
total_mulheres_adultas_alfabetizadas_escravas = instrucao.iloc[4,2]
total_adultos_alfabetizados_escravos = instrucao.iloc[5,2]
total_adultos_alfabetizados_geral = instrucao.iloc[6,2]

soma_adultos_alfabetizados = (int(instrucao[colunas_instrucao_adultos_alfabetizados].sum())) - total_adultos_alfabetizados_livres - total_adultos_alfabetizados_escravos - total_adultos_alfabetizados_geral

print("Homens adultos alfabetizados livres: " + str(total_homens_adultos_alfabetizados_livres))
print("Mulheres adultas alfabetizadas livres: " + str(total_mulheres_adultas_alfabetizadas_livres))
print("Total de adultos alfabetizados livres: " + str(total_adultos_alfabetizados_livres))
print("Homens adultos alfabetizados escravos: " + str(total_homens_adultos_alfabetizados_escravos))
print("Mulheres adultas alfabetizadas escravas: " + str(total_mulheres_adultas_alfabetizadas_escravas))
print("Total de adultos alfabetizados escravos: " + str(total_adultos_alfabetizados_escravos))
print("Total de adultos alfabetizados: " + str(soma_adultos_alfabetizados))

if soma_adultos_alfabetizados == total_adultos_alfabetizados_geral:
    print("OK1")


instrucao[colunas_instrucao_adultos_analfabetos] = instrucao[colunas_instrucao_adultos_analfabetos].apply(pd.to_numeric)

total_homens_adultos_analfabetos_livres = instrucao.iloc[0,3]
total_mulheres_adultas_analfabetas_livres = instrucao.iloc[1,3]
total_adultos_analfabetos_livres = instrucao.iloc[2,3]

total_homens_adultos_analfabetos_escravos = instrucao.iloc[3,3]
total_mulheres_adultas_analfabetas_escravas = instrucao.iloc[4,3]
total_adultos_analfabetos_escravos = instrucao.iloc[5,3]
total_adultos_analfabetos_geral = instrucao.iloc[6,3]

soma_adultos_analfabetos = (int(instrucao[colunas_instrucao_adultos_analfabetos].sum())) - total_adultos_analfabetos_livres - total_adultos_analfabetos_escravos - total_adultos_analfabetos_geral

print("Homens adultos analfabetos livres: " + str(total_homens_adultos_analfabetos_livres))
print("Mulheres adultas analfabetas livres: " + str(total_mulheres_adultas_analfabetas_livres))
print("Total de adultos analfabetos livres: " + str(total_adultos_analfabetos_livres))
print("Homens adultos analfabetos escravos: " + str(total_homens_adultos_analfabetos_escravos))
print("Mulheres adultas analfabetas escravas: " + str(total_mulheres_adultas_analfabetas_escravas))
print("Total de adultos analfabetos escravos: " + str(total_adultos_analfabetos_escravos))
print("Total de adultos analfabetos: " + str(soma_adultos_analfabetos))

if soma_adultos_analfabetos == total_adultos_analfabetos_geral:
    print("OK2")

Homens adultos alfabetizados livres: 3266
Mulheres adultas alfabetizadas livres: 1170
Total de adultos alfabetizados livres: 4436
Homens adultos alfabetizados escravos: 5
Mulheres adultas alfabetizadas escravas: 6
Total de adultos alfabetizados escravos: 11
Total de adultos alfabetizados: 4447
OK1
Homens adultos analfabetos livres: 7056
Mulheres adultas analfabetas livres: 8697
Total de adultos analfabetos livres: 15753
Homens adultos analfabetos escravos: 517
Mulheres adultas analfabetas escravas: 655
Total de adultos analfabetos escravos: 1172
Total de adultos analfabetos: 16925
OK2

In [47]:
# mulheres_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Mulheres')]
# mulheres_escravas = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_adultos].sum() + mulheres_escravas[colunas_adultos].sum()

# soma_mulheres

In [48]:
# colunas_jovens = [('População escolar de 6 a 15 anos', 'Frequentam escolas'), ('População escolar de 6 a 15 anos', 'Não frequentam escolas')]
# instrucao[colunas_jovens] = instrucao[colunas_jovens].apply(pd.to_numeric)

# homens_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Homens')]
# homens_escravos = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Homens')]

# soma_homens = homens_livres[colunas_jovens].sum() + homens_escravos[colunas_jovens].sum()

# soma_homens

In [49]:
# mulheres_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Mulheres')]
# mulheres_escravas = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_jovens].sum() + mulheres_escravas[colunas_jovens].sum()

# soma_mulheres

In [50]:
# colunas_total = [('População escolar de 6 a 15 anos', 'Total')]
# instrucao[colunas_total] = instrucao[colunas_total].apply(pd.to_numeric)

# homens_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Homens')]
# homens_escravos = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Homens')]

# soma_homens = homens_livres[colunas_total].sum() + homens_escravos[colunas_total].sum()

# soma_homens

In [51]:
# mulheres_livres = instrucao.loc[(instrucao[('', 'Condições')] == 'Livres') & (instrucao[('', 'Sexos')] == 'Mulheres')]
# mulheres_escravas = instrucao.loc[(instrucao[('', 'Condições')] == 'Escravos') & (instrucao[('', 'Sexos')] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_total].sum() + mulheres_escravas[colunas_total].sum()

# soma_mulheres

In [52]:
colunas_instrucao_jovens_alfabetizados = [('População escolar de 6 a 15 anos', 'Frequentam escolas')]
colunas_instrucao_jovens_analfabetos = [('População escolar de 6 a 15 anos', 'Não frequentam escolas')]

instrucao[colunas_instrucao_jovens_alfabetizados] = instrucao[colunas_instrucao_jovens_alfabetizados].apply(pd.to_numeric)

total_homens_jovens_alfabetizados_livres = instrucao.iloc[0,4]
total_mulheres_jovens_alfabetizadas_livres = instrucao.iloc[1,4]
total_jovens_alfabetizados_livres = instrucao.iloc[2,4]

total_homens_jovens_alfabetizados_escravos = instrucao.iloc[3,4]
total_mulheres_jovens_alfabetizadas_escravas = instrucao.iloc[4,4]
total_jovens_alfabetizados_escravos = instrucao.iloc[5,4]
total_jovens_alfabetizados_geral = instrucao.iloc[6,4]

soma_jovens_alfabetizados = (int(instrucao[colunas_instrucao_jovens_alfabetizados].sum())) - total_jovens_alfabetizados_livres - total_jovens_alfabetizados_escravos - total_jovens_alfabetizados_geral

print("Homens jovens alfabetizados livres: " + str(total_homens_jovens_alfabetizados_livres))
print("Mulheres jovens alfabetizadas livres: " + str(total_mulheres_jovens_alfabetizadas_livres))
print("Total de jovens alfabetizados livres: " + str(total_jovens_alfabetizados_livres))
print("Homens jovens alfabetizados escravos: " + str(total_homens_jovens_alfabetizados_escravos))
print("Mulheres jovens alfabetizadas escravas: " + str(total_mulheres_jovens_alfabetizadas_escravas))
print("Total de jovens alfabetizados escravos: " + str(total_jovens_alfabetizados_escravos))
print("Total de jovens alfabetizados: " + str(soma_jovens_alfabetizados))

if soma_jovens_alfabetizados == total_jovens_alfabetizados_geral:
    print("OK1")


instrucao[colunas_instrucao_jovens_analfabetos] = instrucao[colunas_instrucao_jovens_analfabetos].apply(pd.to_numeric)

total_homens_jovens_analfabetos_livres = instrucao.iloc[0,5]
total_mulheres_jovens_analfabetas_livres = instrucao.iloc[1,5]
total_jovens_analfabetos_livres = instrucao.iloc[2,5]

total_homens_jovens_analfabetos_escravos = instrucao.iloc[3,5]
total_mulheres_jovens_analfabetas_escravas = instrucao.iloc[4,5]
total_jovens_analfabetos_escravos = instrucao.iloc[5,5]
total_jovens_analfabetos_geral = instrucao.iloc[6,5]

soma_jovens_analfabetos = (int(instrucao[colunas_instrucao_jovens_analfabetos].sum())) - total_jovens_analfabetos_livres - total_jovens_analfabetos_escravos - total_jovens_analfabetos_geral

print("Homens jovens analfabetos livres: " + str(total_homens_jovens_analfabetos_livres))
print("Mulheres jovens analfabetas livres: " + str(total_mulheres_jovens_analfabetas_livres))
print("Total de jovens analfabetos livres: " + str(total_jovens_analfabetos_livres))
print("Homens jovens analfabetos escravos: " + str(total_homens_jovens_analfabetos_escravos))
print("Mulheres jovens analfabetas escravas: " + str(total_mulheres_jovens_analfabetas_escravas))
print("Total de jovens analfabetos escravos: " + str(total_jovens_analfabetos_escravos))
print("Total de jovens analfabetos: " + str(soma_jovens_analfabetos))

if soma_jovens_analfabetos == total_jovens_analfabetos_geral:
    print("OK2")

Homens jovens alfabetizados livres: 799
Mulheres jovens alfabetizadas livres: 559
Total de jovens alfabetizados livres: 1358
Homens jovens alfabetizados escravos: 0
Mulheres jovens alfabetizadas escravas: 0
Total de jovens alfabetizados escravos: 0
Total de jovens alfabetizados: 1358
OK1
Homens jovens analfabetos livres: 1711
Mulheres jovens analfabetas livres: 1896
Total de jovens analfabetos livres: 3607
Homens jovens analfabetos escravos: 0
Mulheres jovens analfabetas escravas: 0
Total de jovens analfabetos escravos: 0
Total de jovens analfabetos: 3607
OK2

# DEFICIENTES

In [53]:
deficientes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23']]
deficientes.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23
0,NaN,NaN,Defeitos físicos,NaN,NaN,NaN,NaN
1,Condições,Sexos,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados
2,Livres,Homens,48,6,158,16,11
3,NaN,Mulheres,41,9,32,21,9
4,NaN,Soma,89,15,190,37,20

In [54]:
new_header = deficientes.iloc[1]
deficientes.columns = new_header
deficientes = deficientes[2:]
deficientes.head()

1 Condições     Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres    Homens    48           6       158       16        11
3       NaN  Mulheres    41           9        32       21         9
4       NaN      Soma    89          15       190       37        20
5  Escravos    Homens     0           0         2        0         0
6       NaN  Mulheres     0           0         2        2         2

In [55]:
deficientes.loc[8, "Condições"] = 'Total'
deficientes

1 Condições       Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres      Homens    48           6       158       16        11
3       NaN    Mulheres    41           9        32       21         9
4       NaN        Soma    89          15       190       37        20
5  Escravos      Homens     0           0         2        0         0
6       NaN    Mulheres     0           0         2        2         2
7       NaN        Soma     0           0         4        2         2
8     Total  Soma geral    89          15       194       39        22

In [56]:
deficientes['Condições'] = deficientes['Condições'].ffill()
deficientes

1 Condições       Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres      Homens    48           6       158       16        11
3    Livres    Mulheres    41           9        32       21         9
4    Livres        Soma    89          15       190       37        20
5  Escravos      Homens     0           0         2        0         0
6  Escravos    Mulheres     0           0         2        2         2
7  Escravos        Soma     0           0         4        2         2
8     Total  Soma geral    89          15       194       39        22

In [57]:
# colunas_deficientes = ['Cegos', 'Surdo-mudos', 'Aleijados', 'Dementes', 'Alienados']
# deficientes[colunas_deficientes] = deficientes[colunas_deficientes].apply(pd.to_numeric)

# homens_livres = deficientes.loc[(deficientes['Condições'] == 'Livres') & (deficientes['Sexos'] == 'Homens')]
# homens_escravos = deficientes.loc[(deficientes['Condições'] == 'Escravos') & (deficientes['Sexos'] == 'Homens')]

# soma_homens = homens_livres[colunas_deficientes].sum() + homens_escravos[colunas_deficientes].sum()

# soma_homens

In [58]:
# mulheres_livres = deficientes.loc[(deficientes['Condições'] == 'Livres') & (deficientes['Sexos'] == 'Mulheres')]
# mulheres_escravas = deficientes.loc[(deficientes['Condições'] == 'Escravos') & (deficientes['Sexos'] == 'Mulheres')]

# soma_mulheres = mulheres_livres[colunas_deficientes].sum() + mulheres_escravas[colunas_deficientes].sum()

# soma_mulheres

In [59]:
colunas_deficientes = ['Cegos', 'Surdo-mudos', 'Aleijados', 'Dementes', 'Alienados']
colunas_cegos = ['Cegos']
colunas_surdomudos = ['Surdo-mudos']
colunas_aleijados = ['Aleijados']
colunas_dementes = ['Dementes']
colunas_alienados = ['Alienados']

deficientes[colunas_cegos] = deficientes[colunas_cegos].apply(pd.to_numeric)

total_homens_cegos_livres = deficientes.iloc[0,2]
total_mulheres_cegas_livres = deficientes.iloc[1,2]
total_cegos_livres = deficientes.iloc[2,2]

total_homens_cegos_escravos = deficientes.iloc[3,2]
total_mulheres_cegas_escravas = deficientes.iloc[4,2]
total_cegos_escravos = deficientes.iloc[5,2]
total_cegos_geral = deficientes.iloc[6,2]

soma_cegos = (int(deficientes[colunas_cegos].sum())) - total_cegos_livres - total_cegos_escravos - total_cegos_geral

print("Homens jovens cegos livres: " + str(total_homens_cegos_livres))
print("Mulheres jovens cegas livres: " + str(total_mulheres_cegas_livres))
print("Total de jovens cegos livres: " + str(total_cegos_livres))
print("Homens jovens cegos escravos: " + str(total_homens_cegos_escravos))
print("Mulheres jovens cegas escravas: " + str(total_mulheres_cegas_escravas))
print("Total de jovens cegos escravos: " + str(total_cegos_escravos))
print("Total de jovens cegos: " + str(soma_cegos))

if soma_cegos == total_cegos_geral:
    print("OK1")


deficientes[colunas_surdomudos] = deficientes[colunas_surdomudos].apply(pd.to_numeric)

total_homens_surdomudos_livres = deficientes.iloc[0,3]
total_mulheres_surdomudas_livres = deficientes.iloc[1,3]
total_surdomudos_livres = deficientes.iloc[2,3]

total_homens_surdomudos_escravos = deficientes.iloc[3,3]
total_mulheres_surdomudas_escravas = deficientes.iloc[4,3]
total_surdomudos_escravos = deficientes.iloc[5,3]
total_surdomudos_geral = deficientes.iloc[6,3]

soma_surdomudos = (int(deficientes[colunas_surdomudos].sum())) - total_surdomudos_livres - total_surdomudos_escravos - total_surdomudos_geral

print("Homens jovens surdo-mudos livres: " + str(total_homens_surdomudos_livres))
print("Mulheres jovens surdo-mudas livres: " + str(total_mulheres_surdomudas_livres))
print("Total de jovens surdo-mudos livres: " + str(total_surdomudos_livres))
print("Homens jovens surdo-mudos escravos: " + str(total_homens_surdomudos_escravos))
print("Mulheres jovens surdo-mudas escravas: " + str(total_mulheres_surdomudas_escravas))
print("Total de jovens surdo-mudos escravos: " + str(total_surdomudos_escravos))
print("Total de jovens surdo-mudos: " + str(soma_surdomudos))

if soma_surdomudos == total_surdomudos_geral:
    print("OK2")

deficientes[colunas_aleijados] = deficientes[colunas_aleijados].apply(pd.to_numeric)

total_homens_aleijados_livres = deficientes.iloc[0,4]
total_mulheres_aleijadas_livres = deficientes.iloc[1,4]
total_aleijados_livres = deficientes.iloc[2,4]

total_homens_aleijados_escravos = deficientes.iloc[3,4]
total_mulheres_aleijadas_escravas = deficientes.iloc[4,4]
total_aleijados_escravos = deficientes.iloc[5,4]
total_aleijados_geral = deficientes.iloc[6,4]

soma_aleijados = (int(deficientes[colunas_aleijados].sum())) - total_aleijados_livres - total_aleijados_escravos - total_aleijados_geral

print("Homens jovens aleijados livres: " + str(total_homens_aleijados_livres))
print("Mulheres jovens aleijadas livres: " + str(total_mulheres_aleijadas_livres))
print("Total de jovens aleijados livres: " + str(total_aleijados_livres))
print("Homens jovens aleijados escravos: " + str(total_homens_aleijados_escravos))
print("Mulheres jovens aleijadas escravas: " + str(total_mulheres_aleijadas_escravas))
print("Total de jovens aleijados escravos: " + str(total_aleijados_escravos))
print("Total de jovens aleijados: " + str(soma_aleijados))

if soma_aleijados == total_aleijados_geral:
    print("OK3")

deficientes[colunas_dementes] = deficientes[colunas_dementes].apply(pd.to_numeric)

total_homens_dementes_livres = deficientes.iloc[0,5]
total_mulheres_dementes_livres = deficientes.iloc[1,5]
total_dementes_livres = deficientes.iloc[2,5]

total_homens_dementes_escravos = deficientes.iloc[3,5]
total_mulheres_dementes_escravas = deficientes.iloc[4,5]
total_dementes_escravos = deficientes.iloc[5,5]
total_dementes_geral = deficientes.iloc[6,5]

soma_dementes = (int(deficientes[colunas_dementes].sum())) - total_dementes_livres - total_dementes_escravos - total_dementes_geral

print("Homens jovens dementes livres: " + str(total_homens_dementes_livres))
print("Mulheres jovens dementes livres: " + str(total_mulheres_dementes_livres))
print("Total de jovens dementes livres: " + str(total_dementes_livres))
print("Homens jovens dementes escravos: " + str(total_homens_dementes_escravos))
print("Mulheres jovens dementes escravas: " + str(total_mulheres_dementes_escravas))
print("Total de jovens dementes escravos: " + str(total_dementes_escravos))
print("Total de jovens dementes: " + str(soma_dementes))

if soma_dementes == total_dementes_geral:
    print("OK4")

deficientes[colunas_alienados] = deficientes[colunas_alienados].apply(pd.to_numeric)

total_homens_alienados_livres = deficientes.iloc[0,6]
total_mulheres_alienadas_livres = deficientes.iloc[1,6]
total_alienados_livres = deficientes.iloc[2,6]

total_homens_alienados_escravos = deficientes.iloc[3,6]
total_mulheres_alienadas_escravas = deficientes.iloc[4,6]
total_alienados_escravos = deficientes.iloc[5,6]
total_alienados_geral = deficientes.iloc[6,6]

soma_alienados = (int(deficientes[colunas_alienados].sum())) - total_alienados_livres - total_alienados_escravos - total_alienados_geral

print("Homens jovens alienados livres: " + str(total_homens_alienados_livres))
print("Mulheres jovens alienadas livres: " + str(total_mulheres_alienadas_livres))
print("Total de jovens alienados livres: " + str(total_alienados_livres))
print("Homens jovens alienados escravos: " + str(total_homens_alienados_escravos))
print("Mulheres jovens alienadas escravas: " + str(total_mulheres_alienadas_escravas))
print("Total de jovens alienados escravos: " + str(total_alienados_escravos))
print("Total de jovens alienados: " + str(soma_alienados))

if soma_alienados == total_alienados_geral:
    print("OK5")

Homens jovens cegos livres: 48
Mulheres jovens cegas livres: 41
Total de jovens cegos livres: 89
Homens jovens cegos escravos: 0
Mulheres jovens cegas escravas: 0
Total de jovens cegos escravos: 0
Total de jovens cegos: 89
OK1
Homens jovens surdo-mudos livres: 6
Mulheres jovens surdo-mudas livres: 9
Total de jovens surdo-mudos livres: 15
Homens jovens surdo-mudos escravos: 0
Mulheres jovens surdo-mudas escravas: 0
Total de jovens surdo-mudos escravos: 0
Total de jovens surdo-mudos: 15
OK2
Homens jovens aleijados livres: 158
Mulheres jovens aleijadas livres: 32
Total de jovens aleijados livres: 190
Homens jovens aleijados escravos: 2
Mulheres jovens aleijadas escravas: 2
Total de jovens aleijados escravos: 4
Total de jovens aleijados: 194
OK3
Homens jovens dementes livres: 16
Mulheres jovens dementes livres: 21
Total de jovens dementes livres: 37
Homens jovens dementes escravos: 0
Mulheres jovens dementes escravas: 2
Total de jovens dementes escravos: 2
Total de jovens dementes: 39
OK4
Homens jovens alienados livres: 11
Mulheres jovens alienadas livres: 9
Total de jovens alienados livres: 20
Homens jovens alienados escravos: 0
Mulheres jovens alienadas escravas: 2
Total de jovens alienados escravos: 2
Total de jovens alienados: 22
OK5

# AUSENTES

In [60]:
ausentes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 24']]
ausentes.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 24
0        NaN        NaN         NaN
1  Condições      Sexos    Ausentes
2     Livres     Homens          41
3        NaN   Mulheres          76
4        NaN       Soma         117

In [61]:
new_header = ausentes.iloc[1]
ausentes.columns = new_header
ausentes = ausentes[2:]
ausentes.head()

1 Condições     Sexos Ausentes
2    Livres    Homens       41
3       NaN  Mulheres       76
4       NaN      Soma      117
5  Escravos    Homens        0
6       NaN  Mulheres        0

In [62]:
ausentes.loc[8, "Condições"] = 'Total'
ausentes

1 Condições       Sexos Ausentes
2    Livres      Homens       41
3       NaN    Mulheres       76
4       NaN        Soma      117
5  Escravos      Homens        0
6       NaN    Mulheres        0
7       NaN        Soma        0
8     Total  Soma geral      117

In [63]:
ausentes['Condições'] = ausentes['Condições'].ffill()
ausentes

1 Condições       Sexos Ausentes
2    Livres      Homens       41
3    Livres    Mulheres       76
4    Livres        Soma      117
5  Escravos      Homens        0
6  Escravos    Mulheres        0
7  Escravos        Soma        0
8     Total  Soma geral      117

In [64]:
# colunas_ausentes = ['Ausentes']
# ausentes[colunas_ausentes] = ausentes[colunas_ausentes].apply(pd.to_numeric)

# homens_livres = ausentes.loc[(ausentes['Condições'] == 'Livres') & (ausentes['Sexos'] == 'Homens')]
# mulheres_livres = ausentes.loc[(ausentes['Condições'] == 'Livres') & (ausentes['Sexos'] == 'Mulheres')]

# print(homens_livres[colunas_ausentes].sum())
# print(mulheres_livres[colunas_ausentes].sum())

In [65]:
# soma_livres = homens_livres[colunas_ausentes].sum() + mulheres_livres[colunas_ausentes].sum()

# soma_livres

In [66]:
colunas_ausentes = ['Ausentes']
ausentes[colunas_ausentes] = ausentes[colunas_ausentes].apply(pd.to_numeric)

total_homens_ausentes_livres = ausentes.iloc[0,2]
total_mulheres_ausentes_livres = ausentes.iloc[1,2]
total_ausentes_livres = ausentes.iloc[2,2]

total_homens_ausentes_escravos = ausentes.iloc[3,2]
total_mulheres_ausentes_escravas = ausentes.iloc[4,2]
total_ausentes_escravos = ausentes.iloc[5,2]
total_ausentes_geral = ausentes.iloc[6,2]

soma_ausentes = (int(ausentes[colunas_ausentes].sum())) - total_ausentes_livres - total_ausentes_escravos - total_ausentes_geral

print("Homens jovens ausentes livres: " + str(total_homens_ausentes_livres))
print("Mulheres jovens ausentes livres: " + str(total_mulheres_ausentes_livres))
print("Total de jovens ausentes livres: " + str(total_ausentes_livres))
print("Homens jovens ausentes escravos: " + str(total_homens_ausentes_escravos))
print("Mulheres jovens ausentes escravas: " + str(total_mulheres_ausentes_escravas))
print("Total de jovens ausentes escravos: " + str(total_ausentes_escravos))
print("Total de jovens ausentes: " + str(soma_ausentes))

if soma_ausentes == total_ausentes_geral:
    print("OK")

Homens jovens ausentes livres: 41
Mulheres jovens ausentes livres: 76
Total de jovens ausentes livres: 117
Homens jovens ausentes escravos: 0
Mulheres jovens ausentes escravas: 0
Total de jovens ausentes escravos: 0
Total de jovens ausentes: 117
OK

# TRANSEUNTES

In [67]:
transeuntes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 25']]
transeuntes.head()

  Unnamed: 0 Unnamed: 1  Unnamed: 25
0        NaN        NaN          NaN
1  Condições      Sexos  Transeuntes
2     Livres     Homens          301
3        NaN   Mulheres          247
4        NaN       Soma          548

In [68]:
new_header = transeuntes.iloc[1]
transeuntes.columns = new_header
transeuntes = transeuntes[2:]
transeuntes.head()

1 Condições     Sexos Transeuntes
2    Livres    Homens         301
3       NaN  Mulheres         247
4       NaN      Soma         548
5  Escravos    Homens           0
6       NaN  Mulheres           0

In [69]:
transeuntes.loc[8, "Condições"] = 'Total'
transeuntes

1 Condições       Sexos Transeuntes
2    Livres      Homens         301
3       NaN    Mulheres         247
4       NaN        Soma         548
5  Escravos      Homens           0
6       NaN    Mulheres           0
7       NaN        Soma           0
8     Total  Soma geral         548

In [70]:
transeuntes['Condições'] = transeuntes['Condições'].ffill()
transeuntes

1 Condições       Sexos Transeuntes
2    Livres      Homens         301
3    Livres    Mulheres         247
4    Livres        Soma         548
5  Escravos      Homens           0
6  Escravos    Mulheres           0
7  Escravos        Soma           0
8     Total  Soma geral         548

In [71]:
# colunas_transeuntes = ['Transeuntes']
# transeuntes[colunas_transeuntes] = transeuntes[colunas_transeuntes].apply(pd.to_numeric)

# homens_livres = transeuntes.loc[(transeuntes['Condições'] == 'Livres') & (transeuntes['Sexos'] == 'Homens')]
# mulheres_livres = transeuntes.loc[(transeuntes['Condições'] == 'Livres') & (transeuntes['Sexos'] == 'Mulheres')]

# print(homens_livres[colunas_transeuntes].sum())
# print(mulheres_livres[colunas_transeuntes].sum())

In [72]:
# soma_livres = homens_livres[colunas_transeuntes].sum() + mulheres_livres[colunas_transeuntes].sum()

# soma_livres

In [73]:
colunas_transeuntes = ['Transeuntes']
transeuntes[colunas_transeuntes] = transeuntes[colunas_transeuntes].apply(pd.to_numeric)

total_homens_transeuntes_livres = transeuntes.iloc[0,2]
total_mulheres_transeuntes_livres = transeuntes.iloc[1,2]
total_transeuntes_livres = transeuntes.iloc[2,2]

total_homens_transeuntes_escravos = transeuntes.iloc[3,2]
total_mulheres_transeuntes_escravas = transeuntes.iloc[4,2]
total_transeuntes_escravos = transeuntes.iloc[5,2]
total_transeuntes_geral = transeuntes.iloc[6,2]

soma_transeuntes = (int(transeuntes[colunas_transeuntes].sum())) - total_transeuntes_livres - total_transeuntes_escravos - total_transeuntes_geral

print("Homens jovens transeuntes livres: " + str(total_homens_transeuntes_livres))
print("Mulheres jovens transeuntes livres: " + str(total_mulheres_transeuntes_livres))
print("Total de jovens transeuntes livres: " + str(total_transeuntes_livres))
print("Homens jovens transeuntes escravos: " + str(total_homens_transeuntes_escravos))
print("Mulheres jovens transeuntes escravas: " + str(total_mulheres_transeuntes_escravas))
print("Total de jovens transeuntes escravos: " + str(total_transeuntes_escravos))
print("Total de jovens transeuntes: " + str(soma_transeuntes))

if soma_transeuntes == total_transeuntes_geral:
    print("OK")

Homens jovens transeuntes livres: 301
Mulheres jovens transeuntes livres: 247
Total de jovens transeuntes livres: 548
Homens jovens transeuntes escravos: 0
Mulheres jovens transeuntes escravas: 0
Total de jovens transeuntes escravos: 0
Total de jovens transeuntes: 548
OK

# CASAS

In [74]:
casas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 26', 'Unnamed: 27']]
casas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 26  Unnamed: 27
0        NaN        NaN       Casas          NaN
1  Condições      Sexos   Habitadas  Desabitadas
2     Livres     Homens         NaN          NaN
3        NaN   Mulheres         NaN          NaN
4        NaN       Soma        3359         1025

In [75]:
new_header = casas.iloc[1]
casas.columns = new_header
casas = casas[2:]
casas.head()

1 Condições     Sexos Habitadas Desabitadas
2    Livres    Homens       NaN         NaN
3       NaN  Mulheres       NaN         NaN
4       NaN      Soma      3359        1025
5  Escravos    Homens       NaN         NaN
6       NaN  Mulheres       NaN         NaN

In [76]:
casas.loc[8, "Condições"] = 'Total'
casas

1 Condições       Sexos Habitadas Desabitadas
2    Livres      Homens       NaN         NaN
3       NaN    Mulheres       NaN         NaN
4       NaN        Soma      3359        1025
5  Escravos      Homens       NaN         NaN
6       NaN    Mulheres       NaN         NaN
7       NaN        Soma       NaN         NaN
8     Total  Soma geral      3359        1025

In [77]:
casas['Condições'] = casas['Condições'].ffill()
casas

1 Condições       Sexos Habitadas Desabitadas
2    Livres      Homens       NaN         NaN
3    Livres    Mulheres       NaN         NaN
4    Livres        Soma      3359        1025
5  Escravos      Homens       NaN         NaN
6  Escravos    Mulheres       NaN         NaN
7  Escravos        Soma       NaN         NaN
8     Total  Soma geral      3359        1025

In [78]:
colunas_casas = ['Habitadas', 'Desabitadas']
casas[colunas_casas] = casas[colunas_casas].apply(pd.to_numeric)

casas_habitadas = casas.loc[(casas['Condições'] == 'Livres') & (casas['Sexos'] == 'Soma')]
casas_desabitadas = casas.loc[(casas['Condições'] == 'Escravos') & (casas['Sexos'] == 'Soma')]

soma_casas  = casas_habitadas[colunas_casas].sum() + casas_desabitadas[colunas_casas].sum()

soma_casas

1
Habitadas      3359.0
Desabitadas    1025.0
dtype: float64

# FOGOS

In [79]:
fogos = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 28']]
fogos.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 28
0        NaN        NaN         NaN
1  Condições      Sexos       Fogos
2     Livres     Homens         NaN
3        NaN   Mulheres         NaN
4        NaN       Soma        3403

In [80]:
new_header = fogos.iloc[1]
fogos.columns = new_header
fogos = fogos[2:]
fogos.head()

1 Condições     Sexos Fogos
2    Livres    Homens   NaN
3       NaN  Mulheres   NaN
4       NaN      Soma  3403
5  Escravos    Homens   NaN
6       NaN  Mulheres   NaN

In [81]:
fogos.loc[8, "Condições"] = 'Total'
fogos

1 Condições       Sexos Fogos
2    Livres      Homens   NaN
3       NaN    Mulheres   NaN
4       NaN        Soma  3403
5  Escravos      Homens   NaN
6       NaN    Mulheres   NaN
7       NaN        Soma   NaN
8     Total  Soma geral  3403

In [82]:
fogos['Condições'] = fogos['Condições'].ffill()
fogos

1 Condições       Sexos Fogos
2    Livres      Homens   NaN
3    Livres    Mulheres   NaN
4    Livres        Soma  3403
5  Escravos      Homens   NaN
6  Escravos    Mulheres   NaN
7  Escravos        Soma   NaN
8     Total  Soma geral  3403

In [83]:
colunas_fogos = ['Fogos']
fogos[colunas_fogos] = fogos[colunas_fogos].apply(pd.to_numeric)

soma_fogos = fogos.loc[(fogos['Condições'] == 'Livres') & (fogos['Sexos'] == 'Soma')]

soma_fogos

1 Condições Sexos   Fogos
4    Livres  Soma  3403.0

In [84]:
#colunas_fogos = ['Fogos']
#df_no_transpose[colunas_fogos] = df_no_transpose[colunas_fogos].apply(pd.to_numeric)

#mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Soma')]
#mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Soma')]

#soma_mulheres = mulheres_livres[colunas_fogos].sum() + mulheres_escravas[colunas_fogos].sum()

#soma_mulheres